name: "preprocess"
backend: "python"
max_batch_size: 16
input [
  {
    name: "images"
    data_type: TYPE_FP32
    format: FORMAT_NHWC
    dims: [ -1, -1, 3 ]   
    reshape { shape: [ 1, -1, -1, 3 ] } 
    
  }
]

output [
  {
    name: "processed"
    data_type: TYPE_FP32
    dims: [ 3, 384, 128 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  },
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]
